In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df =pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-04  0.263703 -0.062808  0.856064  0.607450
2013-01-05  0.360725  0.000436 -0.699720 -1.923650
2013-01-06 -1.032428  0.982935  1.563361  0.494730

In [17]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.values

array([[-3.61091741e-01,  7.98910699e-01, -3.91876052e-01,
         2.82672484e-01],
       [-8.01882754e-01,  3.00103226e-01,  7.92077121e-01,
        -3.03774959e-01],
       [-3.63852294e-01,  1.57117584e+00, -1.45111705e-01,
        -3.64402929e-01],
       [ 2.63702532e-01, -6.28083502e-02,  8.56064479e-01,
         6.07450236e-01],
       [ 3.60724537e-01,  4.35728093e-04, -6.99719679e-01,
        -1.92364958e+00],
       [-1.03242766e+00,  9.82935357e-01,  1.56336053e+00,
         4.94730235e-01]])

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 400.0 bytes

In [22]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.322471  0.598459  0.329132 -0.201162
std    0.556315  0.635312  0.873910  0.935559
min   -1.032428 -0.062808 -0.699720 -1.923650
25%   -0.692375  0.075353 -0.330185 -0.349246
50%   -0.362472  0.549507  0.323483 -0.010551
75%    0.107504  0.936929  0.840068  0.441716
max    0.360725  1.571176  1.563361  0.607450

In [23]:
df

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-04  0.263703 -0.062808  0.856064  0.607450
2013-01-05  0.360725  0.000436 -0.699720 -1.923650
2013-01-06 -1.032428  0.982935  1.563361  0.494730

In [25]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-06 -1.032428  0.982935  1.563361  0.494730
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-05  0.360725  0.000436 -0.699720 -1.923650
2013-01-04  0.263703 -0.062808  0.856064  0.607450

In [26]:
df.sort_values(by='B', ascending=True)

                   A         B         C         D
2013-01-04  0.263703 -0.062808  0.856064  0.607450
2013-01-05  0.360725  0.000436 -0.699720 -1.923650
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-06 -1.032428  0.982935  1.563361  0.494730
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403

In [27]:
df

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-04  0.263703 -0.062808  0.856064  0.607450
2013-01-05  0.360725  0.000436 -0.699720 -1.923650
2013-01-06 -1.032428  0.982935  1.563361  0.494730

In [28]:
df['A']

2013-01-01   -0.361092
2013-01-02   -0.801883
2013-01-03   -0.363852
2013-01-04    0.263703
2013-01-05    0.360725
2013-01-06   -1.032428
Freq: D, Name: A, dtype: float64

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403

In [30]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-04  0.263703 -0.062808  0.856064  0.607450

In [31]:
df[1:4]

                   A         B         C         D
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-04  0.263703 -0.062808  0.856064  0.607450

In [34]:
df['A']

2013-01-01   -0.361092
2013-01-02   -0.801883
2013-01-03   -0.363852
2013-01-04    0.263703
2013-01-05    0.360725
2013-01-06   -1.032428
Freq: D, Name: A, dtype: float64

In [35]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [36]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [37]:
df.loc[dates[0]]

A   -0.361092
B    0.798911
C   -0.391876
D    0.282672
Name: 2013-01-01 00:00:00, dtype: float64

In [40]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.361092  0.798911
2013-01-02 -0.801883  0.300103
2013-01-03 -0.363852  1.571176
2013-01-04  0.263703 -0.062808
2013-01-05  0.360725  0.000436
2013-01-06 -1.032428  0.982935

In [41]:
df.loc[dates[1:3], ['A', 'B']]

                   A         B
2013-01-02 -0.801883  0.300103
2013-01-03 -0.363852  1.571176

In [43]:
df.loc['20130102', df.columns[0:2]]

A   -0.801883
B    0.300103
Name: 2013-01-02 00:00:00, dtype: float64

In [44]:
df.loc[dates[0], 'A']

-0.361091740587882

In [45]:
df.head()

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-04  0.263703 -0.062808  0.856064  0.607450
2013-01-05  0.360725  0.000436 -0.699720 -1.923650

In [46]:
df.iloc[3]

A    0.263703
B   -0.062808
C    0.856064
D    0.607450
Name: 2013-01-04 00:00:00, dtype: float64

In [47]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.263703 -0.062808
2013-01-05  0.360725  0.000436

In [48]:
df.iloc[:]

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-04  0.263703 -0.062808  0.856064  0.607450
2013-01-05  0.360725  0.000436 -0.699720 -1.923650
2013-01-06 -1.032428  0.982935  1.563361  0.494730

In [49]:
df.iloc[[1, 3, 5], [0, 3]]

                   A         D
2013-01-02 -0.801883 -0.303775
2013-01-04  0.263703  0.607450
2013-01-06 -1.032428  0.494730

In [50]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403

In [51]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.798911 -0.391876
2013-01-02  0.300103  0.792077
2013-01-03  1.571176 -0.145112
2013-01-04 -0.062808  0.856064
2013-01-05  0.000436 -0.699720
2013-01-06  0.982935  1.563361

In [52]:
df.iloc[:,1:3].head()

                   B         C
2013-01-01  0.798911 -0.391876
2013-01-02  0.300103  0.792077
2013-01-03  1.571176 -0.145112
2013-01-04 -0.062808  0.856064
2013-01-05  0.000436 -0.699720

In [53]:
df

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-04  0.263703 -0.062808  0.856064  0.607450
2013-01-05  0.360725  0.000436 -0.699720 -1.923650
2013-01-06 -1.032428  0.982935  1.563361  0.494730

In [54]:
df[df.A > 0]

                   A         B         C        D
2013-01-04  0.263703 -0.062808  0.856064  0.60745
2013-01-05  0.360725  0.000436 -0.699720 -1.92365

In [56]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.798911       NaN  0.282672
2013-01-02       NaN  0.300103  0.792077       NaN
2013-01-03       NaN  1.571176       NaN       NaN
2013-01-04  0.263703       NaN  0.856064  0.607450
2013-01-05  0.360725  0.000436       NaN       NaN
2013-01-06       NaN  0.982935  1.563361  0.494730

In [57]:
np.nan

nan

In [59]:
df2 = df.copy()

In [62]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

## md 테스트
* 테스트입니다
    * 테스트라구요

[테스트](http://google.com)

In [63]:
df2

                   A         B         C         D      E
2013-01-01 -0.361092  0.798911 -0.391876  0.282672    one
2013-01-02 -0.801883  0.300103  0.792077 -0.303775    one
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403    two
2013-01-04  0.263703 -0.062808  0.856064  0.607450  three
2013-01-05  0.360725  0.000436 -0.699720 -1.923650   four
2013-01-06 -1.032428  0.982935  1.563361  0.494730  three

In [65]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [66]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403   two
2013-01-05  0.360725  0.000436 -0.699720 -1.923650  four

In [67]:
df2

                   A         B         C         D      E
2013-01-01 -0.361092  0.798911 -0.391876  0.282672    one
2013-01-02 -0.801883  0.300103  0.792077 -0.303775    one
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403    two
2013-01-04  0.263703 -0.062808  0.856064  0.607450  three
2013-01-05  0.360725  0.000436 -0.699720 -1.923650   four
2013-01-06 -1.032428  0.982935  1.563361  0.494730  three

In [69]:
df2['E'].isin(['two', 'four'])[1:3]

2013-01-02    False
2013-01-03     True
Freq: D, Name: E, dtype: bool

In [70]:
df

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -0.801883  0.300103  0.792077 -0.303775
2013-01-03 -0.363852  1.571176 -0.145112 -0.364403
2013-01-04  0.263703 -0.062808  0.856064  0.607450
2013-01-05  0.360725  0.000436 -0.699720 -1.923650
2013-01-06 -1.032428  0.982935  1.563361  0.494730

In [71]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.361092  0.798911 -0.391876  0.282672
2013-01-02 -1.162974  1.099014  0.400201 -0.021102
2013-01-03 -1.526827  2.670190  0.255089 -0.385505
2013-01-04 -1.263124  2.607381  1.111154  0.221945
2013-01-05 -0.902400  2.607817  0.411434 -1.701705
2013-01-06 -1.934827  3.590753  1.974795 -1.206975

In [72]:
df.apply(lambda x: x.max() - x.min())

A    1.393152
B    1.633984
C    2.263080
D    2.531100
dtype: float64